1)
//какие типы встроенных всплывающих окон в js вы знаете?
alert,confirm,prompt

2)
//выведите всплывающее окно с предупреждением 'Осторожно'
alert('carefully')
3)
//выведите всплывающее окно с кнопками подтверждения и отмены
confirm('something')
4)
//выведите всплывающее окно с вопросом и возможностью записать ответ
prompt('How old are you')
5)
//какое временное событие выполняется после ожидания указанного количества миллисекунд?
setTimeout
6)
//какое временное событие непрерывно повторяет выполнение функции?
setInterval
7)
//выведите в консоли сообщение 'НАЧАЛО' с помощью setTimeout
setTimeout(() => {
    console.log('Start');
}, 1000);
8)
//выведите в консоли сообщение 'ПОВТОР' с помощью setInterval каждые 2 секунды
setInterval(() => {
    console.log('repeat');
}, 2000);
9)
//что такое куки?
// Файлы cookie - это данные, которые хранятся на вашем компьютере в небольших текстовых файлах
10)
//как создать куки файл?
document.cookie="user=Omar gamarli"
11)
//как изменить ранее записанный куки?
document.cookie="user=John smith"

12)
//как удалить ранее записанный куки?
document.cookie="user=expires=Wed ,01 Jan 2020"

